Repository: rigopeti96/bbfc_app
Catalog: lib/l10n/app_*.arb
Languages: hu

# mainMenuTitle
source: Main Menu
hu: Főmenü

# userNameTag
source: User name
hu: Felhasználónév

# passwordTag
source: Password
hu: Jelszó

# loginButton
source: Login
hu: Bejelentkezés

# fullNameTag
source: Full name
hu: Teljes név

# emailTag
source: E-mail address
hu: E-mail cím

source: Back
hu: Vissza

source: Profile
hu: Profil

source: Events
hu: Közelgő események

# history
source: Event history
hu: Korábbi események

# injury
source: Register injury
hu: Sérülés bejelentő

source: Settings
hu: Beállítások

source: User handling
hu: Tagok kezelése

source: Seniority
hu: Senioritás

# injuryEstimatedUntil
source: Injured period
hu: Sérült státusz dátuma

# errorTitle
source: Error!
hu: Hiba!

# loginFieldIsEmptyExceptionMessage
source: Username and password must not be empty!
hu: A felhasználónév és a jelszó mezó nem lehet üres!

# ratingFieldIsEmptyExceptionMessage
source: Rating field must not be empty!
hu: Az értékelőmező nem maradhat üres!

source: Change password
hu: Jelszó megváltoztatása

# newPasswordTag
source: New password
hu: Új jelszó

# newPasswordConfTag
source: Confirm new password
hu: Jelszó megerősítése

# saveButtonText
source: Save
hu: Mentés

# oldAndNewPasswordNotMatchExceptionMessage
source: Given password does not match with your password!
hu: A megadott jelszó helytelen!

# newPasswordAndConfirmExceptionMessage
source: New password and password confirm does not match!
hu: A jelszó és a megerősítés nem egyezik!

# trainingFieldIsEmptyExceptionMessage
source: Training value must not be empty!
hu: Edzésterv mezőt ki kell tölteni a mentéshez!

# selectedDateIsInvalidExceptionMessage
source: The selected time cannot be earlier than the current date!
hu: A kiválasztott időpont nem lehet az aktuális dátumnál korábbi!

# selectedBirthDateIsInvalidExceptionMessage
source: The selected birth date cannot be later than the current date!
hu: A kiválasztott születési dátum nem lehet az aktuális dátumnál későbbi!

# userNotFoundExceptionMessage
source: User has been not found!
hu: A kiválasztott felhasználó nem található!

source: Training
hu: Edzés

source: Training history
hu: Korábbi edzések

source: Training plan
hu: Edzésterv

source: Training duration
hu: Edzés időtartam

# trainingDurationMeasurementUnit
source: hour(s)
hu: óra

source: Training place
hu: Edzés helye

# trainingPlanHint
source: Session planned for training
hu: Edzésen tervezett foglalkozás

# trainingPlanSaved
source: Session plan saved for training
hu: Edzésterv mentés sikeres

source: Match
hu: Mérkőzés

source: Sports Medicine Examination
hu: Sportorvosi vizsgálat

# eventResponsePageTitle
source: Event response
hu: Esemény visszajelzés

# denyButton
source: ❌ - Deny
hu: ❌ - Elutasítás

# applyButton
source: ✅ - Apply
hu: ✅ - Jelentkezés

# ratingTag
source: Rating (1-10)
hu: Értékelés (1-10)

# ratingTitle
source: Rating
hu: Értékelés

# ratingValueIsInvalidExceptionMessage
source: Rate value must be between 1 and 10!
hu: Az értékelésnek 1 és 10 között kell lennie!

# createEventTitle
source: Create Event
hu: Esemény létrehozása

# createEventDate
source: Event date
hu: Esemény időpontja

# createEventZipTag
source: Event ZIP Code
hu: Irányítószám

# createEventAddressCityTag
source: Event city
hu: Város

# createEventAddressTag
source: Event address
hu: Cím

# createEventAddress
source: Event address
hu: Esemény helyszíne

# createEventSpecificData
source: Event's specific data
hu: Esemény specifikus adatok

# createEventEnemyTeamTag
source: Enemy team
hu: Ellenfél csapat neve

# createEventPitchNameTag
source: Pitch name
hu: Pálya neve

# createEventSelectorTag
source: Match selector team
hu: Pályaválasztó csapat

# createEventMatchTypeTag
source: Match type
hu: Mérkőzés típusa

# createEventSelectorValueHome
source: Home
hu: Hazai

# createEventSelectorValueAway
source: Away
hu: Idegenbeli

# createMatchTypeValueCup
source: Cup
hu: Kupameccs

# createMatchTypeValueLeague
source: League
hu: Bajnokság

# createExamPrize
source: Prize (Ft)
hu: Vizsgálat ára (Ft)

source: Create user
hu: Létrehozás

source: Modify user
hu: Módosítás

# birthDateAndPlace
source: Date and place of birth
hu: Születési hely, idő

# birthPlaceHint
source: Place of birth
hu: Születési hely

source: Address
hu: Lakcím

source: Number of goals:
hu: Gólok:

source: Number of assists:
hu: Gólpasszok:

# playerStatus
source: Player's status:
hu: Játékos státusza:

source: Suspended until:
hu: Eltiltás határideje:

source: Injured until:
hu: Várható felépülés:

source: Available
hu: Játékra alkalmas

source: Injured
hu: Sérült

source: Suspended
hu: Eltiltott

source: Manage Certificate
hu: Igazoláskezelés

source: Certificate number:
hu: Igazolás száma:

source: Photo valid until:
hu: Fotó érvényesség:

# sportExamValidUntil
source: Sport medicine exam. valid until:
hu: Sportorvosi érvényesség:

# freeExamSpaces
source: Sport medicine exam. spaces:
hu: Szabad pecséthelyek száma:

# btnSelectDate
source: Select date
hu: Dátum választása

# btnSelectToday
source: Today
hu: Mai nap

# newCertDateValues
source: Modification summary
hu: Változtatások
